
&НаСервере
Процедура РассчитатьДокументУстановкаЦенНоменклатурыСервере()
	
	Если Не ЗначениеЗаполнено(УстановкаЦенНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	
	обУстановкаЦенНоменклатуры = УстановкаЦенНоменклатуры.ПолучитьОбъект();
	
	СтруктураФормы = уст_ц_УстановкаЦенСервер.РассчитатьДокументУстановкаЦенНоменклатуры(обУстановкаЦенНоменклатуры);
	
	обУстановкаЦенНоменклатуры.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДокументУстановкаЦенНоменклатуры(Команда)
	РассчитатьДокументУстановкаЦенНоменклатурыСервере();
КонецПроцедуры
