
&НаСервере
Процедура РассчитатьДокументУстановкаЦенНоменклатурыСервере()
	
	Если ЗначениеЗаполнено(ПриобретениеТоваровУслуг) = ЗначениеЗаполнено(УстановкаЦенНоменклатуры) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПриобретениеТоваровУслуг) Тогда 
		обУстановкаЦенНоменклатуры = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
		обУстановкаЦенНоменклатуры.Заполнить(ПриобретениеТоваровУслуг);
	Иначе
		обУстановкаЦенНоменклатуры = УстановкаЦенНоменклатуры.ПолучитьОбъект();
	КонецЕсли;
	
	СтруктураФормы = уст_ц_УстановкаЦенСервер.РассчитатьДокументУстановкаЦенНоменклатуры(обУстановкаЦенНоменклатуры);
	
	обУстановкаЦенНоменклатуры.Записать();
	
	УстановкаЦенНоменклатуры = обУстановкаЦенНоменклатуры.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДокументУстановкаЦенНоменклатуры(Команда)
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Начало заполнения " + ТекущаяДата();
	Сообщение.Сообщить();
	
	РассчитатьДокументУстановкаЦенНоменклатурыСервере();
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Окончание заполнения " + ТекущаяДата();
	Сообщение.Сообщить();

КонецПроцедуры
